# Excercices

## Exercice 1 : Creating and Modifying Series

Create a Pandas Series from a dictionary where keys are ['a', 'b', 'c'] and values are [100, 200, 300].

In [3]:
import pandas as pd
dict={'a': 100, 'b': 200, 'c': 300}
exo1_series = pd.Series(dict)
exo1_series

a    100
b    200
c    300
dtype: int64

## Exercice 2 : Creating DataFrames

Create a DataFrame from the following data:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df_exo2 = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
df_exo2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

Modify the code to add a new column D with values [10, 11, 12].

In [5]:
df_exo2['D'] = [10, 11, 12]
df_exo2

   A  B  C   D
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12


Drop column B from the DataFrame and display the result.

In [8]:
df_exo2=df_exo2.drop(columns=['B'])
df_exo2

   A  C   D
0  1  3  10
1  4  6  11
2  7  9  12

## Exercice 3 : DataFrame Indexing and Selection

Select column B from the following DataFrame:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df_exo3 = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
colonneB = df_exo3['B']
colonneB

0    2
1    5
2    8
Name: B, dtype: int64

Modify the code to select both columns A and C.

In [15]:
colonnesAC=df_exo3[['A', 'C']]
colonnesAC

   A  C
0  1  3
1  4  6
2  7  9

Select the row with index 1 using the .loc method.

In [16]:
row_1 = df_exo3.loc[1]
row_1

A    4
B    5
C    6
Name: 1, dtype: int64

## Exercice 4 : Adding and Removing DataFrame Elements

Add a new column Sum to the DataFrame which is the sum of columns A, B, and C.

In [5]:
df_exo3['somme']=df_exo3['A']+df_exo3['B']+df_exo3['C']
df_exo3

   A  B  C  somme
0  1  2  3      6
1  4  5  6     15
2  7  8  9     24


Remove the column Sum from the DataFrame.

In [6]:
df_exo3=df_exo3.drop(columns=['somme'])
df_exo3

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9


Add a column Random with random numbers generated using numpy.

In [7]:
import numpy as np

df_exo3['Random'] = np.random.rand(len(df_exo3))
df_exo3

   A  B  C    Random
0  1  2  3  0.992111
1  4  5  6  0.659374
2  7  8  9  0.480898

## Exercice 5 : Merging DataFrames

Merge the following two DataFrames on the key column:

In [ ]:
left:
   key  A  B
0    1  A1  B1
1    2  A2  B2
2    3  A3  B3

right:
   key  C  D
0    1  C1  D1
1    2  C2  D2
2    3  C3  D3

In [12]:
left = pd.DataFrame({'key': [1, 2, 3], 'A': ['A1', 'A2', 'A3'], 'B': ['B1', 'B2', 'B3']})
right = pd.DataFrame({'key': [1, 2, 3], 'C': ['C1', 'C2', 'C3'], 'D': ['D1', 'D2', 'D3']})
merged = pd.merge(left, right, on='key', how='inner')
merged

   key   A   B   C   D
0    1  A1  B1  C1  D1
1    2  A2  B2  C2  D2
2    3  A3  B3  C3  D3

Modify the merge to use an outer join instead of an inner join.

Add a new column E to the right DataFrame and update the merge to include this new column.

In [13]:
merged_outer = pd.merge(left, right, on='key', how='outer')
merged_outer

   key   A   B   C   D
0    1  A1  B1  C1  D1
1    2  A2  B2  C2  D2
2    3  A3  B3  C3  D3

In [14]:

right['E'] = ['E1', 'E2', 'E3']
merged_with_e = pd.merge(left, right, on='key', how='outer')
merged_with_e

   key   A   B   C   D   E
0    1  A1  B1  C1  D1  E1
1    2  A2  B2  C2  D2  E2
2    3  A3  B3  C3  D3  E3

## Exercice 6 : Data Cleaning

Replace all NaN values in the following DataFrame with the value 0:

In [ ]:
   A    B    C
0  1.0  NaN  3.0
1  NaN  5.0  6.0
2  7.0  8.0  NaN

In [16]:
df_exo6 = pd.DataFrame({'A': [1.0, np.nan, 7.0], 'B': [np.nan, 5.0, 8.0], 'C': [3.0, 6.0, np.nan]})
df_zero = df_exo6.fillna(0)
df_zero

     A    B    C
0  1.0  0.0  3.0
1  0.0  5.0  6.0
2  7.0  8.0  0.0

Modify the code to replace NaN values with the mean of the column.

Drop rows where any value is NaN.

In [19]:
df_filled_mean = df_exo6.replace(np.nan, df_exo6.mean())
print(df_filled_mean)

     A    B    C
0  1.0  6.5  3.0
1  4.0  5.0  6.0
2  7.0  8.0  4.5

In [20]:
df_dropped = df_exo6.dropna()
print(df_dropped)

Empty DataFrame
Columns: [A, B, C]
Index: []

## Exercice 7 : Grouping and Aggregation

Group the following DataFrame by column Category and calculate the mean of column Value:

In [ ]:
   Category  Value
0         A      1
1         B      2
2         A      3
3         B      4
4         A      5
5         B      6

In [23]:
df_exo7 = pd.DataFrame({'Category': ['A', 'B', 'A', 'B', 'A', 'B'], 'Value': [1, 2, 3, 4, 5, 6]})
df_exo7
grouped_mean = df_exo7.groupby('Category')['Value'].mean()
grouped_mean

Category
A    3.0
B    4.0
Name: Value, dtype: float64

Modify the code to calculate the sum instead of the mean.

Group by Category and count the number of entries in each group.

In [24]:
grouped_sum = df_exo7.groupby('Category')['Value'].sum()
grouped_sum

Category
A     9
B    12
Name: Value, dtype: int64

In [25]:

grouped_count = df_exo7.groupby('Category').size()
grouped_count

Category
A    3
B    3
dtype: int64

## Exercice 8 : Pivot Tables

Create a pivot table from the following DataFrame, showing the mean Value for each Category and Type:

In [ ]:
   Category  Type  Value
0         A     X      1
1         A     Y      2
2         A     X      3
3         B     Y      4
4         B     X      5
5         B     Y      6

In [27]:
df_exo8 = pd.DataFrame({'Category': ['A', 'A', 'A', 'B', 'B', 'B'], 'Type': ['X', 'Y', 'X', 'Y', 'X', 'Y'], 'Value': [1, 2, 3, 4, 5, 6]})
df_exo8

  Category Type  Value
0        A    X      1
1        A    Y      2
2        A    X      3
3        B    Y      4
4        B    X      5
5        B    Y      6

In [28]:
pivot_mean = df_exo8.pivot_table(values='Value', index='Category', columns='Type', aggfunc='mean')
pivot_mean

Type      X  Y
Category
A         2  2
B         5  5

Modify the pivot table to show the sum of Value instead of the mean.

Add margins to the pivot table to show the total mean for each Category and Type.

In [29]:
pivot_sum = df_exo8.pivot_table(values='Value', index='Category', columns='Type', aggfunc='sum')
pivot_sum

Type      X   Y
Category
A         4   2
B         5  10

In [30]:
pivot_margins = df_exo8.pivot_table(values='Value', index='Category', columns='Type', aggfunc='sum', margins=True)
pivot_margins

Type      X   Y  All
Category
A         4   2    6
B         5  10   15
All       9  12   21

## Exercice 9 : Time Series Data

Create a time series DataFrame with a date range starting from '2023-01-01' for 6 periods and random values.

Set the date column as the index of the DataFrame.

Resample the data to calculate the sum for each 2-day period.

In [ ]:
date_rng = pd.date_range(start='2023-01-01', periods=6, freq='D')
df = pd.DataFrame({'Date': date_rng, 'Value': np.random.randint(1, 100, size=(6,))})
df.set_index('Date', inplace=True)
df_resampled = df.resample('2D').sum()
print(df_resampled)

## Exercice 10 : Handling Missing Data

Interpolate missing values in the following DataFrame:

In [ ]:
   A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  NaN
2  NaN  8.0  9.0

In [33]:
df_exo9 = pd.DataFrame({'A': [1.0, 2.0, np.nan], 'B': [np.nan, 5.0, 8.0], 'C': [3.0, np.nan, 9.0]})
df_exo9

     A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  NaN
2  NaN  8.0  9.0

In [34]:

df_interpolated = df_exo9.interpolate()
df_interpolated

     A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  6.0
2  2.0  8.0  9.0

Drop rows with any NaN values instead of interpolating.

In [35]:
df_dropped = df.dropna()
df_dropped

  Category  Value
0        A      1
1        B      2
2        A      3
3        B      4
4        A      5
5        B      6

## Exercice 11 : DataFrame Operations

Calculate the cumulative sum of the following DataFrame:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [37]:
df_exo11 = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
df_cumsum = df_exo11.cumsum()
df_cumsum

    A   B   C
0   1   2   3
1   5   7   9
2  12  15  18

Calculate the cumulative product of the DataFrame.

Apply a function to subtract 1 from all elements in the DataFrame.

In [38]:
df_cumprod = df_exo11.cumprod()
df_cumprod

    A   B    C
0   1   2    3
1   4  10   18
2  28  80  162

In [39]:
df_subtracted = df_exo11.applymap(lambda x: x - 1)
df_subtracted

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8